"""
Задача №2

Необхідно перевезти n книг. Для транспортування можна
використовувати коробки, які вміщають m книг кожна. Порахуйте, я
ку кількість коробок необхідно використати для перевезення всіх
книг за один раз. Користувачем вводиться два цілих числа n і m,
а програма виводить одне ціле число - мінімальну кількість коробок.

Автор: Новосад Сніжана
"""

n = int(input("Введіть кількість книг, які необхідно перевезти: "))  
m = int(input("Введіть кількість книг в одній коробці: "))  

boxes = n // m  


print("Мінімальна кількість коробок, яку потрібно використати:", boxes)
